app/controllers/cars_controller.rb

SELECT  "cars".* FROM "cars" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "cars"
---
  def index
    @title = "All Cars"
    @cars = Car.paginate(:page => params[:page])

INSERT INTO "cars" ("location", "price", "numCars", "numAvail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "car01"], ["price", 3], ["numCars", 3], ["numAvail", 3], ["created_at", "2016-05-30 16:46:10.779406"], ["updated_at", "2016-05-30 16:46:10.779406"]]
---
  def create
    #debugger
    @car = Car.new(car_params)
    if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @car = Car.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "cars" SET "location" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["location", "car01"], ["updated_at", "2016-05-30 17:47:01.890119"], ["id", 1]]
---
  def update
    @car = Car.find(params[:id])
    if @car.update_attributes(car_params)

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reservations" ("userName", "resvType", "identity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["userName", "user01"], ["resvType", 2], ["identity", "car01"], ["created_at", "2016-05-30 16:51:37.315644"], ["updated_at", "2016-05-30 16:51:37.315644"]]
UPDATE "cars" SET "numAvail" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["numAvail", 2], ["updated_at", "2016-05-30 16:51:37.482355"], ["id", 1]]
---
  def order
    #    debugger
    @car = Car.find(params[:format])
    if @car.numAvail > 0
      if signed_in? == false
        redirect_to signin_path, :notice => "Please sign in to order"
        return
      end
      if Reservation.create_order(current_user.name, 3, @car.location) == nil
        flash[:error] = "create reservation error due to mystery reason"
        redirect_to cars_path
        return
      end
      @car.numAvail = @car.numAvail - 1
      @car.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 26]]
SELECT  "cars".* FROM "cars" WHERE "cars"."location" = ? LIMIT 1  [["location", "car01"]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 26]]
UPDATE "cars" SET "numAvail" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["numAvail", 3], ["updated_at", "2016-05-30 17:10:51.005090"], ["id", 1]]
---
  def destroyOrder
    tripTmp = Reservation.find(params[:format])
    carTmp = Car.find_by_location(tripTmp.identity)
    tripTmp.destroy
    if (carTmp == nil)
      redirect_to manage_trip_path
      return
    end
    carTmp.numAvail = carTmp.numAvail + 1;
    carTmp.save

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 5]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 5]]
---
  def destroy
    Car.find(params[:id]).destroy