app/controllers/flights_controller.rb

SELECT  "flights".* FROM "flights" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "flights"
---
  def index
    @title = "All Flights"
    @flights = Flight.paginate(:page => params[:page])

INSERT INTO "flights" ("flightNum", "price", "numSeats", "numAvail", "FromCity", "ArivCity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #debugger
    @flight = Flight.new(flight_params)
    if @flight.save

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @flight = Flight.find(params[:id])

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "flights" SET "numSeats" = ?, "numAvail" = ?, "FromCity" = ?, "ArivCity" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["numSeats", 4], ["numAvail", 4], ["FromCity", 0], ["ArivCity", 0], ["updated_at", "2016-05-30 17:39:50.506321"], ["id", 2]]
---
  def update
    @flight = Flight.find(params[:id])
    if @flight.update_attributes(flight_params)

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reservations" ("userName", "resvType", "identity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["userName", "user01"], ["resvType", 1], ["identity", "flight01"], ["created_at", "2016-05-30 17:49:06.530198"], ["updated_at", "2016-05-30 17:49:06.530198"]]
UPDATE "flights" SET "numAvail" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["numAvail", 2], ["updated_at", "2016-05-30 17:49:06.639204"], ["id", 1]]
---
  def order
    #    debugger
    @flight = Flight.find(params[:format])
    if @flight.numAvail > 0
      if signed_in? == false
        redirect_to signin_path, :notice => "Please sign in to order"
        return
      end
      if Reservation.create_order(current_user.name, 1, @flight.flightNum) == nil
        flash[:error] = "create reservation error due to mystery reason"
        redirect_to flights_path
        return
      end
      @flight.numAvail = @flight.numAvail - 1
      @flight.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "flights".* FROM "flights" WHERE "flights"."flightNum" = ? LIMIT 1  [["flightNum", "flight01"]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 7]]
UPDATE "flights" SET "numAvail" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["numAvail", 2], ["updated_at", "2016-05-30 17:49:25.306802"], ["id", 1]]
---
  def destroyOrder
    tripTmp = Reservation.find(params[:format])
    flightTmp = Flight.find_by_flightNum(tripTmp.identity)
    tripTmp.destroy
    if (flightTmp == nil)
      redirect_to manage_trip_path
      return
    end
    flightTmp.numAvail = flightTmp.numAvail + 1;
    flightTmp.save

DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 1]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    Flight.find(params[:id]).destroy