app/controllers/hotels_controller.rb

  def index
    @title = "All hotels"
    @hotels = Hotel.paginate(:page => params[:page])
---
SELECT  "hotels".* FROM "hotels" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "hotels"

  def create
    #debugger
    @hotel = Hotel.new(hotel_params)
    if @hotel.save
---
INSERT INTO "hotels" ("location", "price", "numRooms", "numAvail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "12345"], ["price", 123], ["numRooms", 12], ["numAvail", 12], ["created_at", "2016-05-30 06:54:33.097479"], ["updated_at", "2016-05-30 06:54:33.097479"]]

  def edit
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @hotel = Hotel.find(params[:id])
    if @hotel.update_attributes(hotel_params)
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "hotels" SET "location" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["location", "1234567"], ["updated_at", "2016-05-30 07:38:35.913320"], ["id", 2]]

  def order
#    debugger
    @hotel = Hotel.find(params[:format])
    if @hotel.numAvail > 0
      if signed_in? == false
        redirect_to signin_path, :notice => "Please sign in to order"
        return
      end
      if Reservation.create_order(current_user.name, 2, @hotel.location) == nil
        flash[:error] = "create reservation error due to mystery reason"
        redirect_to hotels_path
        return
      end
      @hotel.numAvail = @hotel.numAvail - 1
      @hotel.save
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "reservations" ("userName", "resvType", "identity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["userName", "test04"], ["resvType", 2], ["identity", "test01"], ["created_at", "2016-05-30 11:39:13.591540"], ["updated_at", "2016-05-30 11:39:13.591540"]]
UPDATE "hotels" SET "numAvail" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["numAvail", 99], ["updated_at", "2016-05-30 09:28:02.252559"], ["id", 4]]

  def destroyOrder
    tripTmp = Reservation.find(params[:format])
    hotelTmp = Hotel.find_by_location(tripTmp.identity)
    tripTmp.destroy
    if (hotelTmp == nil)
      redirect_to manage_trip_path
      return
    end
    hotelTmp.numAvail = hotelTmp.numAvail + 1;
    hotelTmp.save
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."location" = ? LIMIT 1  [["location", "test01"]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]
UPDATE "hotels" SET "numAvail" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["numAvail", 15], ["updated_at", "2016-05-30 16:15:15.328517"], ["id", 3]]

  def destroy
    Hotel.find(params[:id]).destroy
---
DELETE FROM "hotels" WHERE "hotels"."id" = ?  [["id", 1]]
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 1]]