app/controllers/users_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def tripManage
    @allTrips = Reservation.all;

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "salt", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
   # debugger
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "3cacd419fd63b3e8bb5f1541704b500e51a4e7fde02e28b873c507b746d9afa3"], ["updated_at", "2016-05-29 02:26:04.524812"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)